# --- System stuff ---
# Touchpad gestures
libinput-gestures

# Manage xrandr
mons

# Auto mount usb disks
udisksvm

# --- GUI ---
# Tiling window manager
i3-gaps

# Terminal emulator
alacritty-git

# Status bar
polybar

# Icon theme
pop-icon-theme-git

# GTK theme
pop-gtk-theme-git

# Blurred lock screen with the command `lock`
i3lock-fancy-git

# Symlink rofi in place of dmenu
rofi-dmenu

# Font collection
nerd-fonts-complete

# Manage audio outputs
pavucontrol-gtk2


# --- Terminal ---
# Generate ctags for project directories
universal-ctags-git

# GnuPG v2
gnupg

# For picking out file paths from stdout
fpp-git

# Package manager for the AUR
yay

# Mass move file objects
mmv

# --- Customisation ---
# Keyboard layout
programmers-dvorak


# --- Applications ---
# For managing secrets
keybase-bin

# Music streamer
spotify

# Messenger app for several messaging services
franz

# Fonts for steam
steam-fonts


# --- Development ---
# API exploration tool
postman-bin

# Python IDE
pycharm-professional

# Python version switcher
pyenv

# Manage virtualenvs with pyenv
python-virtualenv

# Use pyenv with virtualenvwrapper
pyenv-virtualenvwrapper

# For RMarkdown compilation
pandoc-bin
