# All packages that should be installed on all ArchLinux deployments

# --- Text editing ---
neovim


# --- System stuff ---
# All the base packages required by ArchLinux
base

# UEFI boot manager
refind-efi

# Intel microcode update
intel-ucode

# For building/compiling new packages
base-devel

# Package manager for the AUR
yaourt

# A network manager to handle wired and wifi connections
networkmanager

# And a system tray applet
network-manager-applet


# --- Terminal tools ---
# Shell
zsh

# Version control
git

# A "better" directory lister
exa

# Quick summarizer of terminal commands
tldr

# A fuzzy finder
fzf

# A faster version of grep
ripgrep

# For connecting to servers
openssh

# File explorer
ranger

# GitHub wrapper for the git client
hub

# For PGP encryption and identification
gnupg

# Check render speed of terminal
cmatrix

# System metrics
gtop


# --- GUI ---
# Window server (package group)
xorg
xorg-server

# Xorg init tool (startx)
xorg-xinit

# OpenGL implementation
mesa

# Compositer (for transparent windows and so on)
compton

# Tiling window manager
i3-gaps

# Commonly used font
ttf-dejavu

# For setting wallpapers
feh

# For changing GTK theme
lxappearance

# For desktop notifications
dunst

# A dmenu like program launcher
rofi

# JSON processor used by $DOTREPO/archlinux/toggle_i3_gaps.zsh
jq

# RSI prevention software
rsibreak

# Used by polybar in order to fetch wireless status
wireless_tools

# Used by i3scripts
xorg-xprop


# --- Developer tools ---
# Newest version of python 3.x.x
python3

# Python3 package manager
python-pip

# When building rust applications
rustup

# A filesystem watcher
inotify-tools


# --- Desktop applications ---
# Web browsers
firefox
qutebrowser

# Filebrowser
thunar
