# All packages that should be installed on all ArchLinux deployments

# --- Text editing ---
neovim


# --- System stuff ---
# Duh
linux
linux-headers

# Linux man entries
man-pages

# All the base packages required by ArchLinux
base

# UEFI boot manager
refind-efi

# Intel microcode update
intel-ucode

# For building/compiling new packages
base-devel

# A network manager to handle wired and wifi connections
networkmanager
network-manager-applet

# Profile based network management
netctl

# And a system tray applet
network-manager-applet

# Sound output tool
alsa-utils

# Also some audio stuff (GUI)
pulseaudio-alsa

# For bluetooth support
pulseaudio-bluetooth

# Wireless network driver
broadcom-wl-dkms

# Partition utility
gparted

# Rotate logs to save space
logrotate

# Automatically mount usb sticks
usbutils


# --- Terminal tools ---
# Terminal emulator
kitty

# Shell
zsh

# Version control
git

# A "better" directory lister
exa

# Quick summarizer of terminal commands
tldr

# A fuzzy finder
fzf

# A faster version of grep
ripgrep

# For connecting to servers
openssh

# File explorer
ranger

# For syntax highlighting in ranger
highlight

# For image preview in ranger
w3m

# GitHub wrapper for the git client
hub

# For PGP encryption and identification
gnupg

# System metrics
gtop

# Bluetooth utility
bluez-utils

# Activity monitor
htop

# Check integrity of PKGBUILD files
namcap

# Archive extraction tool
p7zip

# Password store
pass

# IRC client
weechat


# --- GUI ---
# Window server (package group)
xorg
xorg-server

# Xorg init tool (startx)
xorg-xinit

# OpenGL implementation
mesa

# Compositer (for transparent windows and so on)
compton

# Tiling window manager
i3-gaps

# For setting wallpapers
feh

# For changing GTK theme
lxappearance

# A dmenu like program launcher
rofi

# RSI prevention software
rsibreak

# Used by polybar in order to fetch wireless status
wireless_tools

# Used by i3scripts
xorg-xprop

# Xrandr GUI
arandr

# Desktop module utility
conky

# Color picker
gpick

# PDF reader
okular


# --- Developer tools ---
# Newest version of python 3.x.x
python3

# Python3 package manager
python-pip

# When building rust applications
rust
rustup

# A filesystem watcher
inotify-tools

# Javascript package manager
npm

# Database for work
postgresql

# For pulling files from the internet
wget

# Check owner of domain
whois

# Documentation viewer
zeal


# --- Desktop applications ---
# Web browsers
firefox
qutebrowser

# Filebrowser
thunar

# Gaming client
steam
