# Read this link for documentation: https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/science'

brew 'Caskroom/cask/xquartz'                                                 # Dependency for Rlang
brew 'brew-cask'                                                             # For installing MacOS GUI applications with "brew cask install X"
brew 'brycekahle/sudolikeaboss/sudolikeaboss'                                # 1Password plugin for iTerm2
brew 'cloc'                                                                  # Count the lines of code in a code repository [https://github.com/AlDanial/cloc]
brew 'exa'                                                                   # Use exa as a replacement for ls
brew 'ghi'                                                                   # Manage GitHub issues with ghi
brew 'coreutils'                                                             # Lot's of important terminal tools
brew 'diff-so-fancy'                                                         # https://github.com/so-fancy/diff-so-fancy/blob/master/readme.md
brew 'feh'                                                                   # For opening images from terminal
brew 'flake8'                                                                # Python linter for PEP8 standard
brew 'fzy'                                                                   # Better matching algorithm than fzf
brew 'git'                                                                   # Version control
brew 'macvim', args: ['with-override-system-vim', 'env-std', 'with-python3']
brew 'mobile-shell'                                                          # Mosh: the mobile shell
brew 'mpv'                                                                   # For opening gifs/videos from terminal
brew 'neovim'                                                                # Fork of vim, invoked with nvim
brew 'r', args: ['with-openblas']                                            # Rlang interpreter
brew 'reattach-to-user-namespace'                                            # Fix issues related to copy pasting in tmux on OS X
brew 'ripgrep'                                                               # Faster/easier grep
brew 'ruby'                                                                  # Ruby language for various gems
brew 'shellcheck'                                                            # Shellscript linter
brew 'sqlite3'                                                               # For use with zsh-histdb
brew 'tldr'                                                                  # Example driven documentation of unix commands
brew 'tmux'                                                                  # Terminal multiplexer
brew 'tree'                                                                  # Quick overview of file hierarchy
brew 'unrar'                                                                 # http://www.techradar.com/how-to/computing/apple/terminal-101-extracting-rar-files-1305669
brew 'wget'                                                                  # Recursive web content downloader

# Cask
cask '1password'
cask 'anaconda'
cask 'appcleaner'
cask 'dropbox'
cask 'flux'
cask 'fzf'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'java'
cask 'mactex'
cask 'messenger'
cask 'ngrok'
cask 'notational-velocity'
cask 'numi'
cask 'omnifocus'
cask 'omnifocus-clip-o-tron'
cask 'font-firacode-nerd-font'                                                     # Superpatched version of the FiraCode font (powerline, etc.)
cask 'programmer-dvorak'
cask 'qbserve'
cask 'r-app'
cask 'rescuetime'
cask 'rstudio'
cask 'sizeup'
cask 'slack'
cask 'spotify'
cask 'the_silver_searcher'
cask 'time-out'
cask 'toggldesktop'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'zest'
