# Read this link for documentation: https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew

cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'brycekahle/sudolikeaboss/sudolikeaboss'                                # 1Password plugin for iTerm2
brew 'cloc'                                                                  # Count the lines of code in a code repository [https://github.com/AlDanial/cloc]
brew 'coreutils'                                                             # Lot's of important terminal tools
brew 'diff-so-fancy'                                                         # https://github.com/so-fancy/diff-so-fancy/blob/master/readme.md
brew 'flake8'                                                                # Python linter for PEP8 standard
brew 'fzy'                                                                   # Better matching algorithm than fzf
brew 'git'                                                                   # Version control
brew 'macvim', args: ['with-override-system-vim', 'env-std', 'with-python3']
brew 'mobile-shell'                                                          # Mosh: the mobile shell
brew 'neovim'                                                                # Fork of vim, invoked with nvim
brew 'r'                                                                     # Rlang interpreter
brew 'reattach-to-user-namespace'                                            # Fix issues related to copy pasting in tmux on OS X
brew 'ripgrep'                                                               # Faster/easier grep
brew 'shellcheck'                                                            # Shellscript linter
brew 'tmux'                                                                  # Terminal multiplexer
brew 'tree'                                                                  # Quick overview of file hierarchy
brew 'unrar'                                                                 # http://www.techradar.com/how-to/computing/apple/terminal-101-extracting-rar-files-1305669
brew 'wget'                                                                  # Recursive web content downloader

# Cask
cask '1password'
cask 'anaconda'
cask 'appcleaner'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'fzf'
cask 'goofy'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'mactex'
cask 'messenger'
cask 'ngrok'
cask 'notational-velocity'
cask 'numi'
cask 'nylas-n1'
cask 'omnifocus'
cask 'omnifocus-clip-o-tron'
cask 'programmer-dvorak'
cask 'pycharm'
cask 'qbserve'
cask 'r-app'
cask 'rescuetime'
cask 'rstudio'
cask 'selfcontrol'
cask 'sizeup'
cask 'slack'
cask 'spotify'
cask 'the_silver_searcher'
cask 'time-out'
cask 'toggldesktop'
cask 'transmission'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'zest'
